### 2021_10_05_1

In [1]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])
print(myfood[1:3])  # 첫번째 두번째 가져오기

banana
apple
candy
['apple', 'candy']

In [2]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [3]:
print(dict1['one'])
print(dict2[2])
print(dict3['col2'])

하나
둘
['a', 'b', 'c']

In [4]:
import pandas as pd

In [6]:
# pandas안의 Series와 DataFrame을 불러옴.
from pandas import Series, DataFrame

In [7]:
score = Series( [1000, 14000, 3000, 3000, 1000] )
print(score)
print("자료형 확인 : ", type(score))

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64
자료형 확인 :  <class 'pandas.core.series.Series'>

In [8]:
## Series 인덱스 확인
print(score.index) 

# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(score.index))   

## Series 값 확인
print(score.values) 

## Series 값 자료형 확인
print(score.dtype)

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000  3000  1000]
int64

In [9]:
### 인덱스(index) 속성 이용 
score = Series( [1000, 14000, 3000], 
               index = ['2019-05-01', '2019-05-02', '2019-05-03'] )

print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [10]:
gildong = Series([1500, 3000, 2500], 
                 index = ['2019-05-01', '2019-05-02', '2019-05-03'] )

toto = Series([3000, 3000, 2000], 
              index = ['2019-05-01', '2019-05-03', '2019-05-02'] )

In [11]:
dat = { 'col1' : [1,2,3,4],
        'col2' : [10,20,30,40],
        'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [12]:
from pandas import DataFrame

team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [13]:
date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score,
                   columns=['catanddog', 'toto', 'apple', 'gildong'],
                   index=date)
team_df

          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000

In [14]:
team_df['toto']

19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64

In [15]:
team_df[ ['toto', 'gildong'] ]

          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000

* loc, iloc의 접근
  * loc : 행과 열의 인덱스로 접근
  * iloc : 행과 열의 순서로 접근

In [16]:
print(team_df.loc[ '19-05-02' ] ) # 19-05-02 일
print("-----------")
print(team_df.loc[ ['19-05-02', '19-05-03'] ]) # 5월 2일, 3일 
print("-----------")
print(team_df.loc[ '19-05-02': ])  # 5월 2일 이후 전체 데이터 가져오기

catanddog    5000
toto         3000
apple        5000
gildong      2500
Name: 19-05-02, dtype: int64
-----------
          catanddog  toto  apple  gildong
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
-----------
          catanddog  toto  apple  gildong
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000

In [17]:
## 컬럼명 확인 
print(team_df.columns)
print("-----")
print(team_df.loc[:, 'toto'])   # 전체행, toto팀 
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ])   # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ])   # 전체행, toto 부터 끝까지

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')
-----
19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64
-----
          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000
-----
          toto  apple  gildong
19-05-01  1500   4000     2000
19-05-02  3000   5000     2500
19-05-03  5000   6000     3000
19-05-04  7000   5500     4000
19-05-05  5500   4500     3000

In [18]:
print(team_df.iloc[0])      # 첫번째 행 접근
print("------")
print(team_df.iloc[ [0,1] ])  # 첫번째 두번째 행 접근
print("------")
print(team_df.iloc[ 0:3:1] )  # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] )  # 첫번째부터 세번째 행 접근

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 19-05-01, dtype: int64
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000

In [19]:
print(team_df.iloc[:, 0])      # 첫번째 열 접근
print("------")
print(team_df.iloc[:, [0,1] ])  # 첫번째 두번째 열 접근
print("------")
print(team_df.iloc[:, 0:3:1] )  # 첫번째부터 세번째 열 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[:, range_num ] )  # 첫번째부터 세번째 열 접근

19-05-01    7000
19-05-02    5000
19-05-03    3000
19-05-04    5000
19-05-05    4000
Name: catanddog, dtype: int64
------
          catanddog  toto
19-05-01       7000  1500
19-05-02       5000  3000
19-05-03       3000  5000
19-05-04       5000  7000
19-05-05       4000  5500
------
          catanddog  toto  apple
19-05-01       7000  1500   4000
19-05-02       5000  3000   5000
19-05-03       3000  5000   6000
19-05-04       5000  7000   5500
19-05-05       4000  5500   4500
------
          catanddog  toto  apple
19-05-01       7000  1500   4000
19-05-02       5000  3000   5000
19-05-03       3000  5000   6000
19-05-04       5000  7000   5500
19-05-05       4000  5500   4500

In [20]:
print(team_df.sum() )
print("----")
print(team_df.mean() ) 
print("----")

catanddog    24000
toto         22000
apple        25000
gildong      14500
dtype: int64
----
catanddog    4800.0
toto         4400.0
apple        5000.0
gildong      2900.0
dtype: float64
----

In [21]:

team_df.describe()

         catanddog         toto        apple      gildong
count     5.000000     5.000000     5.000000     5.000000
mean   4800.000000  4400.000000  5000.000000  2900.000000
std    1483.239697  2162.174831   790.569415   741.619849
min    3000.000000  1500.000000  4000.000000  2000.000000
25%    4000.000000  3000.000000  4500.000000  2500.000000
50%    5000.000000  5000.000000  5000.000000  3000.000000
75%    5000.000000  5500.000000  5500.000000  3000.000000
max    7000.000000  7000.000000  6000.000000  4000.000000

In [22]:
team_df['rowsum'] = team_df.sum(axis=1)
team_df

          catanddog  toto  apple  gildong  rowsum
19-05-01       7000  1500   4000     2000   14500
19-05-02       5000  3000   5000     2500   15500
19-05-03       3000  5000   6000     3000   17000
19-05-04       5000  7000   5500     4000   21500
19-05-05       4000  5500   4500     3000   17000

In [23]:
team_df.rowsum.sort_values(ascending=False)

19-05-04    21500
19-05-05    17000
19-05-03    17000
19-05-02    15500
19-05-01    14500
Name: rowsum, dtype: int64

In [24]:
team_df.sort_values(by='rowsum', ascending=False)

          catanddog  toto  apple  gildong  rowsum
19-05-04       5000  7000   5500     4000   21500
19-05-03       3000  5000   6000     3000   17000
19-05-05       4000  5500   4500     3000   17000
19-05-02       5000  3000   5000     2500   15500
19-05-01       7000  1500   4000     2000   14500

In [25]:
team_df[ team_df.rowsum >= 17000]

          catanddog  toto  apple  gildong  rowsum
19-05-03       3000  5000   6000     3000   17000
19-05-04       5000  7000   5500     4000   21500
19-05-05       4000  5500   4500     3000   17000

In [26]:
team_df.drop(['toto', 'gildong' ], axis=1)

          catanddog  apple  rowsum
19-05-01       7000   4000   14500
19-05-02       5000   5000   15500
19-05-03       3000   6000   17000
19-05-04       5000   5500   21500
19-05-05       4000   4500   17000

In [27]:
team_df.dtypes

catanddog    int64
toto         int64
apple        int64
gildong      int64
rowsum       int64
dtype: object

In [29]:
team_df.isnull().sum()

catanddog    0
toto         0
apple        0
gildong      0
rowsum       0
dtype: int64

In [31]:
import seaborn as sns

In [32]:
train = sns.load_dataset("titanic")
train.shape

(891, 15)

In [33]:
train.describe(include=['O'])

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [34]:
grp = train.groupby(['pclass'])
grp.count()

        survived  sex  age  sibsp  ...  deck  embark_town  alive  alone
pclass                             ...
1            216  216  186    216  ...   175          214    216    216
2            184  184  173    184  ...    16          184    184    184
3            491  491  355    491  ...    12          491    491    491

[3 rows x 14 columns]

In [35]:
grp = train.groupby(['pclass', 'sex'])
grp.count()

               survived  age  sibsp  parch  ...  deck  embark_town  alive  alone
pclass sex                                  ...
1      female        94   85     94     94  ...    81           92     94     94
       male         122  101    122    122  ...    94          122    122    122
2      female        76   74     76     76  ...    10           76     76     76
       male         108   99    108    108  ...     6          108    108    108
3      female       144  102    144    144  ...     6          144    144    144
       male         347  253    347    347  ...     6          347    347    347

[6 rows x 13 columns]

In [36]:
grp = train.groupby(['pclass', 'sex'], as_index=False)
grp.mean()['survived']

0    0.968085
1    0.368852
2    0.921053
3    0.157407
4    0.500000
5    0.135447
Name: survived, dtype: float64

In [37]:
train_df = train.drop(['deck', 'embark_town'], axis=1)
train_df

     survived  pclass     sex   age  ...    who  adult_male  alive  alone
0           0       3    male  22.0  ...    man        True     no  False
1           1       1  female  38.0  ...  woman       False    yes  False
2           1       3  female  26.0  ...  woman       False    yes   True
3           1       1  female  35.0  ...  woman       False    yes  False
4           0       3    male  35.0  ...    man        True     no   True
..        ...     ...     ...   ...  ...    ...         ...    ...    ...
886         0       2    male  27.0  ...    man        True     no   True
887         1       1  female  19.0  ...  woman       False    yes   True
888         0       3  female   NaN  ...  woman       False     no  False
889         1       1    male  26.0  ...    man        True    yes   True
890         0       3    male  32.0  ...    man        True     no   True

[891 rows x 13 columns]

In [38]:
train_df['embarked'] = train_df['embarked'].fillna('S')
train_df['embarked'] = train_df['embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)
train_df

     survived  pclass     sex   age  ...    who  adult_male  alive  alone
0           0       3    male  22.0  ...    man        True     no  False
1           1       1  female  38.0  ...  woman       False    yes  False
2           1       3  female  26.0  ...  woman       False    yes   True
3           1       1  female  35.0  ...  woman       False    yes  False
4           0       3    male  35.0  ...    man        True     no   True
..        ...     ...     ...   ...  ...    ...         ...    ...    ...
886         0       2    male  27.0  ...    man        True     no   True
887         1       1  female  19.0  ...  woman       False    yes   True
888         0       3  female   NaN  ...  woman       False     no  False
889         1       1    male  26.0  ...    man        True    yes   True
890         0       3    male  32.0  ...    man        True     no   True

[891 rows x 13 columns]